# Data 200: Data Systems for Data Analytics (Spring 2024)

# Homework 9: Inner and Outer Joins in SQL

<font color='red'>**Due Date and Time:** 1:30pm on Tuesday, 3/26/2024 </font>
---
Enter your name in the markdown cell below.

# Name: Minh Trinh

In [1]:
## RUN THIS CELL TO GET THE RIGHT FORMATTING AND TO LOAD NumPy
import requests
import numpy as np
from IPython.core.display import HTML
styles = requests.get("https://raw.githubusercontent.com/Harvard-IACS/2018-CS109A/master/content/styles/cs109.css").text
HTML(styles)

# Tasks

- **Make sure you have installed SQL Magic before beginning**--see pages 177-179 in the Course Notes.
- Review pages 216-248 in the Course Notes.
- Complete the **Introducing Inner Joins** and **Outer Joins, Cross Joins and Self Joins** chapters of the **Joining Data in SQL** course on DataCamp.
- Complete the **Basics of Relational Databases** chapter of the **Introduction to Databases in Python** course on DataCamp.
- Complete the **Seaborn Introduction** chapter of the **Intermediate Data Visualization with Seaborn** course on DataCamp.
- E-mail me your completed Jupyter notebook.

# Exercises (Part 1)

This homework will make use of the`school.db` database, which is available under Files in Teams.  I suggest that you review pages 226-228 in the Course Notes to familiarize yourself with the tables in this database.  You may also want to open the `school.db` database in SQLiteStudio to examine the tables as you work on the queries below.

**Download the `school.db` database from Teams and save it to the same directory as this notebook.**

**Then, run the code cells below to load the SQL Magic module and connect to the `school.db` database.**

In [2]:
%load_ext sql

In [3]:
%sql sqlite:///school.db

'Connected: @school.db'

<div class="exercise"><b>Exercise 1:</b></div> 

Write a query to obtain the department chairs for Modern Language (`'LANG'`), Philosophy (`'PHIL'`), and Mathematics and Computer Science (`'MATH'`).  Note that you will need to use an <u>inner join</u> of the `departments` and `instructors` tables.  Project the department name, the chair's last name, and the chair's first name.

Below is the output from my solution:<br>
<code>
departmentname	              instructorlast	instructorfirst
Modern Language	             Brown	         Danielle
Mathematics & Computer Science  Bradley       	Betty
Philosophy	                  Singhal	       Aarav
</code>

In [4]:
%%sql

/* Enter your SQL query below */
SELECT departments.departmentname, instructors.instructorlast, instructors.instructorfirst
FROM departments INNER JOIN instructors
ON departments.departmentchair = instructors.instructorid
WHERE departments.departmentid IN ('LANG', 'PHIL', 'MATH');

 * sqlite:///school.db
Done.

[('Modern Language', 'Brown', 'Danielle'),
 ('Mathematics & Computer Science', 'Bradley', 'Betty'),
 ('Philosophy', 'Singhal', 'Aarav')]

<div class="exercise"><b>Exercise 2:</b></div> 

Write a query to list all of the students who are mathematics (`'MATH'`) majors.  Include the student's last and first name, along with the name of the department.  Order the results by last name, first name.  Limit the results to 6 rows.  Note that you will need to use an <u>inner join</u> on the `students` and `subjects` tables.

Below is the output from my solution:<br>
<code>
studentlast	studentfirst	subjectname
Barnett	    Larry	       Mathematics
Campbell	   Gloria	      Mathematics
Chapman	    Robert	      Mathematics
Colombo	    Giulia	      Mathematics
Davis	      Crystal	     Mathematics
Edwards    	Gary	        Mathematics
</code>

In [5]:
%%sql

/* Enter your SQL query below */
SELECT students.studentlast, students.studentfirst, subjects.subjectname
FROM students INNER JOIN subjects
ON students.studentmajor = subjects.subjectid
WHERE students.studentmajor IS 'MATH'
ORDER BY studentlast, studentfirst ASC
LIMIT 6;

 * sqlite:///school.db
Done.

[('Barnett', 'Larry', 'Mathematics'),
 ('Campbell', 'Gloria', 'Mathematics'),
 ('Chapman', 'Robert', 'Mathematics'),
 ('Colombo', 'Giulia', 'Mathematics'),
 ('Davis', 'Crystal', 'Mathematics'),
 ('Edwards', 'Gary', 'Mathematics')]

<div class="exercise"><b>Exercise 3:</b></div> 

Write a query to list all of the students who are taking Math 123-03 in the fall (this corresponds to `classid=40326`). Please use a `USING` clause on `studentid` (to give you practice with it).  Order the results by last name, first name.  Limit the results to 6 rows.  

Below is the output from my solution:<br>
<code>
studentlast	studentfirst
Brewer	     Scott
Castillo	   Stephen
Chapman	    Robert
Coleman	    Billy
Dunn	       Diane
Fox	        Luke
</code>

In [6]:
%%sql

/* Enter your SQL query below */
SELECT s.studentlast, s.studentfirst
FROM students AS s INNER JOIN student_class AS c
USING (studentid)
WHERE c.classid IN ('40326')
ORDER BY s.studentlast, s.studentfirst
LIMIT 6

 * sqlite:///school.db
Done.

[('Brewer', 'Scott'),
 ('Castillo', 'Stephen'),
 ('Chapman', 'Robert'),
 ('Coleman', 'Billy'),
 ('Dunn', 'Diane'),
 ('Fox', 'Luke')]

<div class="exercise"><b>Exercise 4:</b></div> 

Write a query to find which instructors (last and first names) are teaching in the spring semester.  Your result should not contain any duplicates.  Order the results by last name, first name.  Limit the results to 10 rows. **Hint:** You will need to use a <u>three-table join</u> of the `classes`, `instructor_class`, and `instructors` tables.

Below is the output from my solution:<br>
<code>
instructorlast	instructorfirst
Aguilar	       Stephen
Anderson	      Philip
Arnaud	        Antoine
Austin	        Stephanie
Bailey	        Jayden
Balasubramanium   Hemant
Balasubramanium   Vishal
Banks	         Carolyn
Banks	         David
Barnes   	     Deborah
</code>

In [13]:
%%sql

/* Enter your SQL query below */
SELECT DISTINCT i.instructorlast, i.instructorfirst
FROM classes AS c INNER JOIN instructor_class AS ic INNER JOIN instructors AS i
ON c.classid = ic.classid AND ic.instructorid = i.instructorid
WHERE c.classterm IN ('SPRING')
ORDER BY i.instructorlast, i.instructorfirst
LIMIT 10

 * sqlite:///school.db
Done.

[('Aguilar', 'Stephen'),
 ('Anderson', 'Philip'),
 ('Arnaud', 'Antoine'),
 ('Austin', 'Stephanie'),
 ('Bailey', 'Jayden'),
 ('Balasubramanium', 'Hemant'),
 ('Balasubramanium', 'Vishal'),
 ('Banks', 'Carolyn'),
 ('Banks', 'David'),
 ('Barnes', 'Deborah')]

# Exercises (Part 2)

<div class="exercise"><b>Exercise 5:</b></div> 

Write a query to list all courses (subject and number) that were *not* taught in either the fall or spring semesters.  **Hint:** Recall that LEFT JOIN can be used to compute *set differences*.  In particular, you will need to use a left join of the `courses` and `classes` tables.  Furthermore, in order to match up the course subject and number, you may want to use `USING (coursesubject, coursenum)`. Finally, you will want to use a `WHERE classid IS NULL`.  Order your results by the course subject and limit your results to six rows.

The output from my solution is:<br>
<code>
coursesubject	coursenum
ARTH	         363
ARTH	         452
BIOL	         363
BIOL	         364
BLST	         265
BLST	         361
</code>

In [14]:
%%sql

/* Enter your SQL query below */
SELECT DISTINCT c.coursesubject, c.coursenum
FROM courses AS c
LEFT JOIN classes AS cl USING (coursesubject, coursenum)
WHERE cl.classid IS NULL
ORDER BY c.coursesubject, c.coursenum
LIMIT 6;

 * sqlite:///school.db
Done.

[('ARTH', 363),
 ('ARTH', 452),
 ('BIOL', 363),
 ('BIOL', 364),
 ('BLST', 265),
 ('BLST', 361)]

<div class="exercise"><b>Exercise 6:</b></div> 

Write a query to find all English courses (subject, number, and title) that were *not* offered in either the fall or spring semesters.  *This is very similar to the previous exercise, but you will need to adjust the WHERE clause to also ensure you are only including English courses*.

The output from my solution is:<br>
<code>
coursesubject	coursenum	coursetitle
ENGL	         340	      Contemporary Drama
ENGL	         349	      Studies in European Lit
</code>

In [15]:
%%sql

/* Enter your SQL query below */
SELECT c.coursesubject, c.coursenum, c.coursetitle
FROM courses AS c
LEFT JOIN classes AS cl USING (coursesubject, coursenum)
WHERE c.coursesubject = 'ENGL' AND cl.classid IS NULL
ORDER BY c.coursesubject, c.coursenum;

 * sqlite:///school.db
Done.

[('ENGL', 340, 'Contemporary Drama'), ('ENGL', 349, 'Studies in European Lit')]

<div class="exercise"><b>Exercise 7:</b></div> 

Write a query to list instructors (first and last names) and the *number of students* they taught during the year (both fall and spring semesters).  Only include instructors who were actually teaching.  Please name the new column `total_taught` and order your results from smallest to largest.  Limit the results to 10 rows. **Hint:** You will need to join three different tables and use a GROUP BY to accomplish this task.

The output from my solution is:<br>
<code>
instructorfirst	instructorlast	total_taught
Margaux	        Gillet            1
Lisa	           Fuller	        1
Bobby	          Hall	          1
Harrison	       Gray	          1
Aarav	          Jhadav	        2
Kyle	           Stevens	       4
Rose	           James	         5
Philip	         Anderson	      7
Paul	           Dixon	         7
Michelle	       Young	         8
</code>

In [21]:
%%sql

/* Enter your SQL query below */
SELECT i.instructorfirst, i.instructorlast, COUNT(s.studentid) AS total_taught
FROM instructors AS i
JOIN instructor_class AS ic 
ON i.instructorid = ic.instructorid

JOIN classes AS c ON ic.classid = c.classid
JOIN student_class AS s
ON c.classid = s.classid

WHERE c.classterm IN ('FALL', 'SPRING')
GROUP BY i.instructorid
ORDER BY total_taught ASC
LIMIT 10;

 * sqlite:///school.db
Done.

[('Margaux', 'Gillet', 1),
 ('Lisa', 'Fuller', 1),
 ('Bobby', 'Hall', 1),
 ('Harrison', 'Gray', 1),
 ('Aarav', 'Jhadav', 2),
 ('Kyle', 'Stevens', 4),
 ('Rose', 'James', 5),
 ('Philip', 'Anderson', 7),
 ('Paul', 'Dixon', 7),
 ('Michelle', 'Young', 8)]

<div class="exercise"><b>Exercise 8:</b></div> 

Note that in the last exercise we learned that the instructor Kyle Stevens only taught a total of 4 students during the year (which is strange--let's investigate).  Write a query to list the student IDs of these four students, along with the course subject, course number, and course title.  **Hint 1:** In my solution, I joined together five different tables (using four INNER JOIN statements)!  **Hint 2:** You may want to first see if you can list the course subject, course number, and student ID.  Then join the fifth table to get the course title.  That is, sometimes it's easier to build your query in stages to make it more manageable.

The output from my solution is (we can see that Kyle only taught senior research and directed studies):<br>
<code>
coursesubject	coursenum	coursetitle	   studentid
BIOL	         452	      Senior Research   61724
BIOL	         451	      Senior Research   61724
BIOL	         362	      Directed Study    62419
BIOL	         362	      Directed Study    62925
</code>

In [22]:
%%sql

/* Enter your SQL query below */
SELECT c.coursesubject, c.coursenum, c.coursetitle, s.studentid
FROM instructors AS i
INNER JOIN instructor_class AS ic 
ON i.instructorid = ic.instructorid

INNER JOIN classes AS cl 
ON ic.classid = cl.classid

INNER JOIN courses AS c 
ON cl.coursesubject = c.coursesubject AND cl.coursenum = c.coursenum

INNER JOIN student_class AS s 
ON cl.classid = s.classid

WHERE i.instructorfirst = 'Kyle' AND i.instructorlast = 'Stevens'
ORDER BY c.coursetitle DESC;

 * sqlite:///school.db
Done.

[('BIOL', 452, 'Senior Research', 61724),
 ('BIOL', 451, 'Senior Research', 61724),
 ('BIOL', 362, 'Directed Study', 62419),
 ('BIOL', 362, 'Directed Study', 62925)]